/*Да се напише програма која за внесени две времиња (во формат чч:мм:сс чч-час, мм-минути, сс-секунди)
ќе пресмета и отпечати колку е периодот помеѓу нив (во формат чч:мм:сс). Напомена: Секогаш првовнесеното време е помало (во минатото) во споредба со второ време. 
Двете времиња секогаш припаѓаат во ист ден, односно нема да има тест пример каде прво време е 23:30:00 и второ внесено време е 00:30:00.*/

#include <stdio.h>

int main()
{
   int h1,h2,m1,m2,s1,s2,s,h,m;
   scanf("%d %d %d %d %d %d", &h2,&m2,&s2,&h1,&m1,&s1);
   s=(h1*3600+m1*60+s1)-(h2*3600+m2*60+s2);
   h=s/3600;
   s-=h*3600;
   m=s/60;
   s-=m*60;
   printf("%.2d:%.2d:%.2d", h,m,s);


    return 0;
}


//Примерот од друг:

#include<stdio.h>

int main () {
    int c1,c2,m1,m2,s1,s2;
    scanf("%d %d %d", &c1, &m1, &s1);
    scanf("%d %d %d", &c2, &m2, &s2);
    
    int total1 = c1*3600+m1*60+s1;
    int total2 = c2*3600+m2*60+s2;
    int diff = total2 - total1;
    printf("%02d:%02d:%02d", diff/3600, diff%3600/60, diff%60);
    return 0;
}
