/* Од стандарден влез се вчитуваaт три броја кои ги означуваат времињата (во минути) со кои три натпреварувачи истрчале 5км на Скопскиот маратон. 

Да се испечати редниот број на најбрзиот натпреварувач. Доколку најбрзо време имаат повеќе од еден натпреварувач, се печатат редните броеви на сите такви натпреварувачи.


For example:

Input	Result
23 34 35.2
1
20.1 20.1 20.5
12
*/

#include <stdio.h>
#include <stdlib.h>

int main()
{

   float v1,v2,v3;
   scanf("%f %f %f", &v1, &v2, &v3);
   if ( v1 <= v2 && v1 <= v3)
   {
       printf("1");
   }
   if (v2 <= v1 && v2 <= v3)
   {
       printf("2");
   }
   if (v3 <= v2 && v3 <= v1)
   {
       printf("3");
   }


    return 0;
}
