/* Од стандарден влез се вчитуваат следните податоци за еден студент на ФИНКИ:

индекс (шестцифрен цел број)
шест оценки од последниот семестар кој го слушал
Да се напише програма која што на стандарден излез ќе ги испечати следните информации за студентот: (погледнете во тест примерите за форматот на печатење)

просек на студентот
просекот да се испечати со точност од 3 децимали
година на студии
студентите чијшто индекс почнува на 21 се втора година, 20 се трета година, 19 се четврта година итн.
дали е награден (1 = награден, 0 = не е награден)
Еден студент се наградува доколку има просек еднаков или поголем од 9.5 */

#include <stdio.h>

int main()
{

    int indeks, godina;
    float prosek;
    scanf("%d", &indeks);
    int o1, o2, o3 ,o4 , o5 , o6;
    scanf("%d%d%d%d%d%d", &o1 , &o2 , &o3, &o4, &o5, &o6);
    prosek = (o1+o2+o3+o4+o5+o6)/6.00;
    godina = (23-(indeks/10000))%10;
    printf("Prosek: %.3f\n", prosek);
    printf("Student: %d\n", indeks);
    printf("%d godina\n", godina);
    if (prosek >= 9.5){
        printf("Nagraden: 1\n");
    } else {
        printf("Nagraden: 0\n");
    }
return 0;

}
