/* Од стандарден влез се вчитува број N, а потоа и N цели броеви. 

Да се испечати на екран најголемата разлика помеѓу два последователно внесени броја.

Да се реши без користење на низи!

Објаснување на примерот:
N=5, па се внесуваат 5 броја: 1,3,0,5,2. Разликите се соодветно:
3-1 = 2
0-3 = -3
5-0 = 5
2-5 = -3

Најголема разлика е 5.

For example:

Input	Result
5
1
3
0
5
2
5
*/

#include <stdio.h>

int main() {

  int N, a, b, maxrazl;
  scanf("%d ", &N);
  scanf("%d ", &a);
  scanf("%d ", &b);
  maxrazl= a-b;
  
  for(int i=0; i<(N-2); i++){
    a=b;
    scanf("%d", &b);
    if ((b-a)>maxrazl)
      maxrazl=b-a;
  } printf("%d", maxrazl);
  
  return 0;
}
