/* Од тастатура се внесуваат цели броеви се додека не се внесе нешто што не е цел број.

Да се испечати на екран сумата на броевите во кои цифрите се подредени во опаѓачки редослед. Доколку нема такви броеви, да се испечати порака NEMA.

Објаснување на примерот:

Во првиот пример, нема ниту еден број во кој цифрите се подредени во опаѓачки редослед, па се печати NEMA.

Во вториот пример, во 4321, 21 и 81, цифрите се подредени во опаѓачки редослед, па се печати нивната сума 4423.

For example:

Input	Result
123
124
127
.
NEMA

123
4321
21
81
15
.
4423
*/

#include <stdio.h>


int main()
{

    int n, suma=0, tmp=0, a,b;
    while(scanf("%d", &n)){
        tmp = n;
        a = tmp % 10;
        tmp /= 10;
        b = tmp % 10;
        if (b > a){
            a = tmp % 10;
            tmp /= 10;
            b = tmp % 10;
        }
    }
    if(tmp==0) suma +=n;
    if (suma>0) printf("%d", suma);
    else if(suma==0) printf("NEMA");

        return 0;
}
