/*
Полу-елка се црта со ѕвездички (*) и прачки (|) на следниот начин:

*
|
|**
|
|***
|
|****

Значи, во првиот ред има ѕвездичка. Во следниот ред има прачка. 
Понатаму преку еден ред имаме или само прачка или прачка со неколку ѕвездички (една повеќе отколку во прет-претходниот ред). 
Полу-елката завршува со ред во кој има една прачка и N ѕвездички.
За дадено N, отпечатете ја полу-елката според описот.
За N=4, треба на излез да се добие како примерот погоре.
For example:

Input	Result
4

*/

#include <stdio.h>
#include <stdlib.h>

int main()
{
    int n,c=0,d=2;
    scanf("%d", &n);
    printf("*\n");
    if(n!=1){
        while(1){
            printf("|");
            if(c%2!=0){
                for(int i=0;i<d;i++)
                    printf("*");
                    d++;
                }
                if(d==n+1) break;
                    c++;
                    printf("\n");
            }
}
    return 0;
}
