/*
Подреден број е број кај кој секоја следна цифра е поголема или еднаква на претходната (гледајќи од најзначајната кон најмалку значајната). На пример, 12234.

Да се напише програма во која прво се внесува број N кој го определува вкупниот број на броеви кои ќе бидат внесени од тастатура. Потоа се внесуваат N-те броеви, 
еден по еден. На излез, потребно е да се испечатат сите броеви кои го исполнуваат условот за подреден број, а потоа да се отпечати сумата на сите внесени 
Подредени броеви и нивниот број.


Пример за влез

Пример за излез

5
11
341
12
876
1257
11
12
1257
1280

3
*/
#include <stdio.h>

int main()
{
    
    int n,tmp,i,zbir=0,br,p=0;
    scanf("%d", &n);
        for(i=0;i<n;i++){
            scanf("%d", &br);
            tmp=br;
            while(tmp>0){
                if(tmp%10<((tmp/10)%10)) break;
                tmp/=10;
            }
            if(tmp==0){
                printf("%d\n",br);
                zbir+=br;
                p++;
            }
        }
        printf("%d\n%d\n", zbir,p);
    
    return 0;
}
